sap price group soap body

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope
    xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:n0="http://sap.com/xi/SAPGlobal20/Global">

  <soap-env:Header/>

  <soap-env:Body>
    <n0:SalesPriceListFindByTypeCodeAndPropertyIDAndPropertyValueQuery_sync>
      <SalesPriceList>
        <TypeCode>{{TYPE_CODE}}</TypeCode>

        <PropertyValuationPriceSpecificationElementPropertyValuation1>
          <IdentifyingIndicator>{{IS_IDENTIFYING}}</IdentifyingIndicator>
          <PriceSpecificationElementPropertyReference>
            <PriceSpecificationElementPropertyID>{{PROPERTY_ID}}</PriceSpecificationElementPropertyID>
          </PriceSpecificationElementPropertyReference>
          <PriceSpecificationElementPropertyValue>
            <ID>{{PROPERTY_VALUE}}</ID>
          </PriceSpecificationElementPropertyValue>
        </PropertyValuationPriceSpecificationElementPropertyValuation1>

      </SalesPriceList>
    </n0:SalesPriceListFindByTypeCodeAndPropertyIDAndPropertyValueQuery_sync>
  </soap-env:Body>
</soap-env:Envelope>
